---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationName(System.Int32)
source: html/63f50dfb-2da5-cb46-41b6-7524f6e4380c.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationName Method

Gets the insulation specification name from its identifier.

## Syntax (C#)
```csharp
public string GetInsulationSpecificationName(
	int specId
)
```

## Parameters
- **specId** (`System.Int32`) - The insulation specification identifier.

## Returns
The insulation specification name.